/* ### Задача 1: Виведення зафарбованого прямокутника розміром `m` на `n`

**Умова**: Користувач вводить два цілі числа `m` і `n`, де `m` — кількість рядків, а `n` — кількість стовпців. Програма має вивести на екран прямокутник розміром `m` на `n`, повністю заповнений символами `*`.

**Вхідні дані**: Два цілі числа `m` і `n` (1 ≤ `m`, `n` ≤ 100).

**Вихідні дані**: Прямокутник розміром `m` на `n`, заповнений символами `*`.

**Приклад**:

Вхід:
```
3 4
```

Вихід:
```
****
****
****
```


--- */

#include <iostream>
int main() {
	int m, n;
	std::cout << "Enter m and n" << std::endl;
	std::cin >> m >> n;
	for(int i = m; i > 0; i--) {
		for(int j = n; j > 0; j--) {
			std::cout << "*";
		}
		std::cout << std::endl;
	}
}
