/* Напишіть програму для розрахунку простих відсотків для конкретного
клієнта банку для заданої суми P (плаваючого типу), періоду позики T
(int) і процентної ставки R (плаваючої). Результатом є значення виразу I
= (P * T * R )/100. Виведіть результат і як float, і як int. Відобразіть
результат як дійсне значення з точністю до двох знаків після коми. */

#include <iostream>
int main() {
	int t;
	float p, r;
	std::cout << "Enter P, T and R" << std::endl;
	std::cin >> p >> t >> r;
	int res1 = (p*r*t)/100;
	float res2 = (p*r*t)/100;
	std::cout << res1 << " " << res2 << std::endl;
}
