/* ### Задача 4: Заповнення прямокутника змійкою

**Умова**: Користувач вводить два цілі числа `m` і `n`, де `m` — кількість рядків, а `n` — кількість стовпців. Програма має заповнити двовимірний масив розміром `m` на `n` числами у вигляді "змійки": перший рядок заповнюється зліва направо, другий — справа наліво, третій — зліва направо і так далі.

**Вхідні дані**: Два цілі числа `m` і `n` (0 ≤ `m`, `n` ≤ 100).

**Вихідні дані**: Двовимірний масив розміром `m` на `n`, заповнений числами у вигляді змійки.

**Приклад**:

Вхід:
```
3 4
```

Вихід:
```
0  1  2  3
7  6  5  4
8  9 10 11
``` */

#include <iostream> 
int main() {
	int m, n;
	std::cout << "Enter m and n" << std::endl;
	std::cin >> m >> n;
	int p = 0;
	for (int i = 0; i < m; i++) {
		int b = p;
		for (int j = n; j > 0; j--) {
			if (i%2 == 0) {
				std::cout << p << " ";
				p++;
			}
			else {
				std::cout << b+j-1 << " ";
				p++;
			}
		}
		std::cout << std::endl;
	}
}
