/* ### Задача 2: Виведення порожнистого прямокутника розміром `m` на `n` із товщиною межі `k`

**Умова**: Користувач вводить три цілі числа `m`, `n` і `k`, де `m` — кількість рядків, `n` — кількість стовпців, а `k` — товщина заповненої межі. Програма має вивести на екран порожнистий прямокутник розміром `m` на `n`, у якому межа товщиною `k` заповнена символами `*`, а внутрішня область залишається порожньою.

**Вхідні дані**: Три цілі числа `m`, `n` і `k` (1 ≤ `k` < `m`, `k` < `n`, 1 ≤ `m`, `n` ≤ 100).

**Вихідні дані**: Порожнистий прямокутник розміром `m` на `n` із межами товщиною `k`, заповнений символами `*`.

**Приклад**:

Вхід:
```
5 5 2
```

Вихід:
```
*****
*****
** **
*****
*****
2

11 12 13 14 15
21 22 23 24 25
31 32 33 34 35
41 42 43 44 45
51 52 53 54 55

*******
*     *
*     *
*     *
*     *
*     *
*******
1

11 12 13 14 15 16 17
21 21 23 24 25 26 27
31 32 33 34 35 36 37
41 42 43 44 45 46 47
51 52 53 54 55 56 57
61 62 63 64 65 66 67
71 72 73 74 75 76 77
``` */

#include <iostream>
int main() {
	int m, n, k;
	std::cout << "Enter m, n and k" << std::endl;
	std::cin >> m >> n >> k;
	for (int row = 1; row <= m; row++) {
		for (int column = 1; column <= n; column++) {
			if (row <= k || column <= k) {
				std::cout << "*";
			}
			else if (row+k > m || column+k > n) {
				std::cout << "*";
			}
			else {
				std::cout << " ";
			}
		}
		std::cout << std::endl;
	}
}
