/* ### Задача 5: Заповнення прямокутника спіраллю

**Умова**: Користувач вводить два цілі числа `m` і `n`, де `m` — кількість рядків, а `n` — кількість стовпців. Програма має заповнити прямокутник розміром `m` на `n` числами у вигляді "спіралі": починаючи з верхнього лівого кута, рухаючись праворуч, потім вниз, потім ліворуч і так далі, заповнюючи прямокутник по спіралі до середини.

**Вхідні дані**: Два цілі числа `m` і `n` (1 ≤ `m`, `n` ≤ 100).

**Вихідні дані**: Прямокутник розміром `m` на `n`, заповнений числами по спіралі.

**Приклад**:

Вхід:
```
3 4
```

Вихід:
```
0  1  2  3
9 10 11  4
8  7  6  5

0  1  2
9 10  3
8 11  4
7  6  5


6 6
0  1  2  3  4  5
19 20 21 22 23 6
18 31 32 33 24 7
17 30 35 34 25 8
16 29 28 27 26 9
15 14 13 12 11 10


0 1
7 2
6 3
5 4

0  1  2  3  4
13 14 15 16 5
12 19 18 17 6
11 10 9  8  7

0  1  2  3
13 14 15 4
12 19 16 5
11 18 17 6
10 9  8  7

0  1  2  3  4  5  6
23 24 25 26 27 28 7
22 39 40 41 42 29 8
21 38 47 48 43 30 9
20 37 46 45 44 31 10
19 36 35 34 33 32 11
18 17 16 15 14 13 12

0  1  2  3  4  5  6
21 22 23 24 25 26 7
20 35 36 37 38 27 8
19 34 41 40 39 28 9
18 33 32 31 30 29 10
17 16 15 14 13 12 11

0  1  2  3  4  5
21 22 23 24 25 6
20 35 36 37 26 7
19 34 41 38 27 8
18 33 40 39 28 9
17 32 31 30 29 10
16 15 14 13 12 11
``` */

#include <iostream>
int main() {
	int m, n;
	std::cout << "Enter m and n" << std::endl;
	std::cin >> m >> n;
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < n; j++) {
			if (i == 0) {
				std::cout << j << " ";
			}
			else if (j == 0) {
				std::cout << j-i+2*n+2*m-4 << " ";
			}
			else if (i/2 <= m/2 && i+j < n) {
				std::cout << j-i+2*n+2*m-4 << " ";
			}
			else {
				std::cout << " ";
			}
		}
		std::cout << std::endl;
	}
}
