/* ### Задача 6: Малювання сніжинки
**Умова**: Користувач вводить ціле число `n` , де `n` — висота сніжинки. Програма має вивести на екран сніжинку висотою `n` яка складається з символів `*`.

**Вхідні дані**: Ціле число `n` (1 ≤ `n` ≤ 100).

**Вихідні дані**: Сніжинка розміром `n` яка складається з символів `*`.

**Приклад**:

Вхід:
```
5
```

Вихід:
```
* * * 
 ***
***** 
 *** 
* * *
   
 11 12 13 14 15
 21 22 23 24 25
 31 32 33 34 45
 41 42 43 44 45
 51 52 53 54 55
 
 *  *  *
  * * *
   ***
 *******
   ***
  * * *
 *  *  *
 
11 12 13 14 15 16 17
21 22 23 24 25 26 27
31 32 33 34 35 36 37
41 42 43 44 45 46 47
51 52 53 54 55 56 57
61 62 63 64 65 66 67
71 72 73 74 75 76 77

``` */

#include <iostream>
int main() {
	int n;
	std::cout << "Enter n: " << std::endl;
	std::cin >> n;
	for (int row = 1; row <= n; row++){
		for (int column = 1; column <= n; column++) {
			if (column == (n+1)/2) {
				std::cout << "*";
			}
			else if (row == (n+1)/2) {
				std::cout << "*";
			}
			else if (row == column || row+column == n+1 ) {
				std::cout << "*";
			}
			else {
				std::cout << " ";
			}
		}
		std::cout << std::endl;
	}
}
